class Question {
  final String questionText;
  final List<String> options;
  final String type;

  Question({
    required this.questionText,
    required this.options,
    this.type = 'multiple_choice',
  });
}

final List<Question> modelQuestions = [
  Question(
    questionText:
        'बिजली की उपलब्धता पूर्ण वायरिंग एवं सभी कमरों में पर्याप्त मात्रा में प्रकाश की व्यवस्था ।',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'इन्वर्टर उपलब्ध एवं कार्यशील।',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'रनिंग वाटर एवं पेयजल की उपलब्धता ।',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'शौचालय की उपलब्धता कार्यशील के साथ (महिला एवं पुरुष के लिये अलग अलग)',
    options: ['हाँ', 'नहीं'],
  ),
  Question(questionText: 'सूचना पट्ट', options: ['हाँ', 'नहीं']),
  Question(questionText: 'व्हाईट बोर्ड', options: ['हाँ', 'नहीं']),
  Question(questionText: 'पेपर स्टैंड', options: ['हाँ', 'नहीं']),
  Question(
    questionText: 'मईया कक्ष में बेड, पर्दा एवं कुर्सी की उपलब्धता',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'ऊर्जा कक्ष में कैरम बोर्ड, शतरंज एवं लूडो की उपलब्धता',
    options: ['हाँ', 'नहीं'],
  ),
  Question(questionText: 'स्वच्छता कक्ष', options: ['हाँ', 'नहीं']),
  Question(
    questionText: 'सभी कमरों में पर्याप्त संख्या में फर्नीचर की उपलब्धता ।',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'कमरे के सभी खिड़कियों एवं दरवाजों में अच्छी गुणवत्ता का पर्दा',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'अच्छी गुणवत्ता के कम से कम 15 फूल के गमले।',
    options: ['हाँ', 'नहीं'],
  ),
  Question(questionText: 'सक्सेसर बोर्ड', options: ['हाँ', 'नहीं']),
  Question(questionText: 'सीसीटीवी', options: ['हाँ', 'नहीं']),
  Question(questionText: 'माईक सिस्टम', options: ['हाँ', 'नहीं']),
  Question(questionText: 'दीप प्रज्ज्वल स्टैंड', options: ['हाँ', 'नहीं']),
  Question(questionText: 'नेम प्लेट', options: ['हाँ', 'नहीं']),
  Question(
    questionText:
        'क्या पंचायत सचिवालय में CWSN (चिल्ड्रेन विथ स्पेशल नीड टॉयलेट्स) उपलब्ध हैं',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'केबिन फैन - संख्या (जरुरत के अनुसार)',
    options: [],
    type: 'number',
  ),
  Question(questionText: 'कूलर', options: ['हाँ', 'नहीं']),
  Question(questionText: 'इंटरनेट (वाई - फाई)', options: ['हाँ', 'नहीं']),
  Question(
    questionText: 'पंचायतों में हो रहे कार्यों का फोटोग्राफ प्रदर्शनी',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'पंचायतों में क्रियान्वित हो रही योजनाओं की प्रदर्शनी',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'कूड़ादान - 03 (सूखा कचरा, गीला कचरा, प्लास्टिक कचरा)',
    options: ['हाँ', 'नहीं'],
  ),
  Question(questionText: '05 छातो की उपलब्धता', options: ['हाँ', 'नहीं']),
  Question(questionText: 'हेल्पडेस्क का निर्माण', options: ['हाँ', 'नहीं']),
  Question(
    questionText: 'फर्श पर टाईल्स का अधिष्ठापन जहाँ कारपेट नहीं लगा हुआ है।',
    options: ['हाँ', 'नहीं'],
  ),
  Question(questionText: 'दरी - (बड़ा)', options: ['हाँ', 'नहीं']),
  Question(
    questionText: 'झंडोत्तोलन स्थल का उन्नयीकरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'वेस्टर्न शौचालय की उपलब्धता',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'फर्नीचर की उपलब्धता',
    options: ['अच्छा', 'औसत', 'निम्न'],
  ),
  Question(
    questionText: 'पेयजल की उपलब्धता',
    options: ['चापाकल', 'बोरिंग', 'सप्लाई', 'अन्य', 'नहीं'],
  ),
  Question(
    questionText: 'वैध बिजली कनेक्शन की उपलब्धता',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'क्या पंचायत द्वारा बिजली बिल प्राप्त कर भुगतान किया जा रहा है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'क्या पंचायत कर्मी द्वारा ग्राम पंचायत से बायोमेट्रिक उपस्थिति दर्ज की जा रही है?',
    options: ['हाँ', 'नहीं', 'कभी-कभी', 'जांच होने पर'],
  ),
  Question(
    questionText: 'क्या पंचायत में साफ-सफाई हेतु कर्मी रखा गया है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'क्या पंचायत में रात्रि प्रहरी के रूप में कर्मी रखा गया है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'क्या VLE नियमित रूप से पंचायत सचिवालय में बैठते हैं?',
    options: ['हाँ', 'नहीं', 'कभी-कभी', 'जांच होने पर'],
  ),
  Question(
    questionText:
        'क्या पंचायत सचिवालय भवन में सभी को कमरा आवंटित है एवं दीवाल लेखन किया गया है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'क्या पंचायत सचिवालय भवन में VWSC को कमरा आवंटित है एवं दीवाल लेखन किया गया है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'क्या पंचायत सचिवालय भवन में SHG को कमरा आवंटित है एवं दीवाल लेखन किया गया है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'क्या रोस्टर का दीवाल लेखन किया गया है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'पंचायत भवन में यदि ज्ञान केंद्र है तो क्या नियमानुसार अधिष्ठापित किया गया है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'क्या ज्ञान केंद्र का संचालन हो रहा है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'क्या पुस्तकालय प्रबंधन एवं सलाहकार समिति का गठन किया गया है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'पुस्तकालय प्रबंधन एवं सलाहकार समिति के विवरण का दीवाल लेखन?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'क्या प्रोजेक्ट प्रकृति अंतर्गत पंचायत सचिवालय में वृक्षारोपण किया गया है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'प्रोजेक्ट प्रकृति अंतर्गत पंचायत सचिवालय में वृक्षारोपण किये गये पेड़ों की संख्या',
    options: [],
    type: 'number',
  ),
  Question(
    questionText:
        'क्या पंचायत सचिवालय परिसर में भस्मक (Incinerator) उपलब्ध है?',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'क्या भस्मक का उपयोग किया जा रहा है?',
    options: ['नियमित रूप से', 'कभी-कभी', 'नहीं'],
  ),
  Question(
    questionText: 'भ्रमण के दौरान सेग्रीगेशन बिन (Segregation Bin) की स्थिति',
    options: ['उपयोग में', 'उपयोग में नहीं'],
  ),
  Question(
    questionText: 'दीवाल लेखन की स्थिति: पंचायत संपूर्ण विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'दीवाल लेखन की स्थिति: पंचायत में कार्यरत कर्मी/मुखिया/वार्ड सदस्य एवं अन्य की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'दीवाल लेखन की स्थिति: कार्यालय संचालन संबंधित विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'योजना विवरण: प्रधानमंत्री आवास योजना (ग्रामीण) से आच्छादित लाभुकों की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText:
        'योजना विवरण: स्थायी प्रतीक्षा सूची में सम्मिलित व्यक्तियों की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'योजना विवरण: वित्त मद से क्रियान्वित योजनाओं की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'योजना विवरण: मनरेगा से क्रियान्वित योजनाओं की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'योजना विवरण: अन्य मद से क्रियान्वित योजनाओं की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'वित्त मद से क्रियान्वित योजनाओं के अभिलेख की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText: 'मनरेगा से क्रियान्वित योजनाओं के अभिलेख की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText:
        'पंचायत सचिवालय सुदृढ़ीकरण योजना से क्रियान्वित योजनाओं के अभिलेख की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText: 'पंचायत ज्ञान केंद्र योजना के अभिलेख की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText: 'विभिन्न मद से क्रियान्वित योजनाओं के पंजी की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText: 'ग्राम सभा पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'कार्यकारिणी पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'योजना पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'आवंटन पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'रोकड़बही की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'प्राप्ति एवं निर्गत पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'F.T.O पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'किराया, शुल्क, दंड तथा कर पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'अभिश्रव पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'भंडार पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'परिसंपत्ति पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'निरीक्षण पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: '7 रजिस्टर (अन्य) की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'पंचायत सचिवालय सुदृढ़ीकरण योजना पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'पंचायत सचिवालय सुदृढ़ीकरण योजना रोकड़ बही की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'पंचायत सचिवालय सुदृढ़ीकरण योजना भंडार पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'जन्म & मृत्यु निर्गत पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'पत्र प्राप्ति एवं निर्गत पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
];
