import "package:panchayat_mitra/data/model_questions.dart";

final List<Question> modelQuestionsPart3 = [
  Question(
    questionText:
        'योजना विवरण: स्थायी प्रतीक्षा सूची में सम्मिलित व्यक्तियों की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'योजना विवरण: वित्त मद से क्रियान्वित योजनाओं की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'योजना विवरण: मनरेगा से क्रियान्वيت योजनाओं की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'योजना विवरण: अन्य मद से क्रियान्वित योजनाओं की विवरण',
    options: ['हाँ', 'नहीं'],
  ),
  Question(
    questionText: 'वित्त मद से क्रियान्वित योजनाओं के अभिलेख की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText: 'मनरेगा से क्रियान्वित योजनाओं के अभिलेख की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText:
        'पंचायत सचिवालय सुदृढ़ीकरण योजना से क्रियान्वित योजनाओं के अभिलेख की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText: 'पंचायत ज्ञान केंद्र योजना के अभिलेख की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText: 'विभिन्न मद से क्रियान्वित योजनाओं के पंजी की स्थिति',
    options: [
      'पंचायत भवन में संधारित कर सुरक्षित रखा जाता है।',
      'आवास में संधारित कर सुरक्षित रखा जाता है।',
      'संधारण नहीं किया जाता है।',
    ],
  ),
  Question(
    questionText: 'ग्राम सभा पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'कार्यकारिणी पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'योजना पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'आवंटन पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'रोकड़बही की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'प्राप्ति एवं निर्गत पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'F.T.O पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'किराया, शुल्क, दंड तथा कर पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'अभिश्रव पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'भंडार पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'परिसंपत्ति पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'निरीक्षण पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: '7 रजिस्टर (अन्य) की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'पंचायत सचिवालय सुदृढ़ीकरण योजना पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'पंचायत सचिवालय सुदृढ़ीकरण योजना रोकड़ बही की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'पंचायत सचिवालय सुदृढ़ीकरण योजना भंडार पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'जन्म & मृत्यु निर्गत पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
  Question(
    questionText: 'पत्र प्राप्ति एवं निर्गत पंजी की स्थिति',
    options: [
      'संधारित है एवं अद्यतन है',
      'संधारित है परंतु अद्यतन नहीं है',
      'संधारित नहीं है',
    ],
  ),
];
